public/about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-10-12 Sat 17:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>JHJ Technology: About</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">JHJ Technology: About</h1>
<p>
<a href="index.html">Home</a>
</p>

<p>
We are a lean consultancy, providing agility and flexibility, rather than red tape and complex process.
We work in small specialist "squads", rather than huge, resource wasteful development teams.
</p>

<div id="outline-container-org85b770f" class="outline-2">
<h2 id="org85b770f">Get to know us better</h2>
<div class="outline-text-2" id="text-org85b770f">
<p>
We have a track record of turning complex business requirements into sustainable, scalable, and valuable
software systems. If we had to describe JHJ's niche then it would be client focused.
</p>

<p>
We are all techies at heart but our experience tells us that there is an over
emphasis on the tech, often at the expense of the client, we want to flip that
and focus on solution delivery for the client, the tech just facilitates that.
</p>
</div>
</div>

<div id="outline-container-org568e1b7" class="outline-2">
<h2 id="org568e1b7">Our People</h2>
<div class="outline-text-2" id="text-org568e1b7">
</div>
<div id="outline-container-orgb01feed" class="outline-3">
<h3 id="orgb01feed">Mark Woodhall</h3>
<div class="outline-text-3" id="text-orgb01feed">
<p>
<b>Founder</b>
</p>

<p>
Mark has a wealth of experience in the Software Development industry, ranging from large global corporates to start-ups.
</p>

<p>
This experience has been built over the course of 20 years in various Software Engineering roles. 
</p>

<p>
Still a hands on Engineer Mark loves leading client projects and building functional teams.
</p>

<blockquote>
<p>
I’ve worked with Mark for nearly three years, and I’ve never known someone to be so committed to
the job at hand.
</p>

<p>
I could probably list what he’s qualified in, but I’m pretty sure most of it is up here
somewhere, what I will tell you is that he’s a dedicated professional who is a natural problem solver,
someone who can see the logic behind an issue and how to get around it.
</p>

<p>
Most of all he's a nice bloke, who you can get on with and progress your project to the nth degree.
</p>

<p>
I couldn’t recommend Mark enough, you just won’t go wrong with him behind you. Thanks for all your help Mark! ⭐️
</p>
</blockquote>
</div>

<div id="outline-container-org298d9dc" class="outline-4">
<h4 id="org298d9dc">Why Clojure?</h4>
<div class="outline-text-4" id="text-org298d9dc">
<p>
Mark started to learn Clojure around 10 years ago after becoming frustrated with working on large object
oriented codebases written in Java and C#. Thinking that there must be a better way, he started investigating
functional programming, and fell in love with Clojure and Lisp.
</p>

<p>
Clojure has changed the way I view many problems, even down to how I configure my text editor (vim).
Traditionally I used VimScript and/or Lua to configure vim but there is nothing quite like a live REPL
for building out the tools you use daily and my love for Lisp resulted in me making use of Fennel
to configure vim, and in the process gaining access to a REPL.
</p>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-10-12 Sat 17:58</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.6.15)</p>
</div>
</body>
</html>
